<template>
  <div class="team">
    <h1 class="team__title">Наша команда</h1>

    <div class="team__gallery">
      <figure
        class="team__shape"
        v-for="item in list"
        v-on:click="(showPopup=true) && (currentItem = item)"
      >
        <img v-bind:src="item.img" alt="Team photo" class="team__photo">
        <figcaption class="team__caption">
          <b>{{ item.title }}</b>
          <br>
          <br>
          <i class="team__small-text">
            {{
            item.position }}
          </i>
        </figcaption>
      </figure>
    </div>
    <person :person="currentItem" v-if="showPopup" @close="showPopup = false"></person>
  </div>
</template>

<script>
import person from "./Person";
class Card {
  constructor(title, img, position, text, photos) {
    this.title = title;
    this.img = img;
    this.position = position;
    this.text = text;
    this.photos = photos;
  }
}

export default {
  name: "Team",
  data() {
    return {
      showPopup: false,
      currentItem: "",
      list: [
        new Card(
          "Евгений Крекотень",
          "photos/1.jpg",
          "Генеральный директор",
          `Крекотень Евгений Владимирович - родился в 1985 г. в г. Углегорск Сахалинской области. 
          В 2007 году окончил Дальневосточный государственный технический университет г. Владивосток по специальности «Инженер радиовещания и телевидения».
          С 2002 г. по 2011 г. работал в Дальневосточном филиале ПАО «МегаФон», где прошел трудовой путь от инженера транспортной сети до руководителя отдела эксплуатации. В 2011 году приглашен в Головной офис ПАО «МегаФон» в Москве на должность Руководителя по реализации специальных государственных проектов. За время работы были реализованы комплексные проекты по предоставлению услуг связи для государственных заказчиков - Пенсионного фонда РФ, Министерства внутренних дел, Федерального казначейства, Федеральной службы безопасности на всей территории РФ. 
          В 2014 г. успешно реализовал проект по обеспечению связи для средств безопасности Внутренних войск МВД РФ при проведении Олимпийских игр, за что был удостоен государственной награды. 
          С 2013 г. по 2017 г. работал в ООО «НэтБайНэт Холдинг» г. Москва в должности Директора по развитию бизнеса. Были реализованы первые проекты по предоставлению телекоммуникационных услуг на железнодорожном транспорте в РФ и городском общественном транспорте в Москве. 
          С декабря 2017 года назначен Генеральным директором ООО «РДЛ-Телеком».
          `,
          ["photos/sait-22.jpg", "photos/sait-21.jpg"]
        ),
        new Card(
          "Анастасия Кузнецова",
          "photos/2.jpg",
          "Финансовый директор",
          `
        Кузнецова Анастасия Юрьевна родилась в Москве. В 2009 году окончила Московский государственный университет инженерной экологии (ныне присоединен к МГТУ «МАМИ») по специальности Инвестиционный менеджмент. 
        В 2017 году окончила Национальный Технологический университет по специальности Управление денежными потоками.
        С 2011 по 2016 гг. исполняла обязанности заместителя финансового директора в финансовом управлении в компании Advanced System Technologies, специализирующейся на разработке корпоративных информационных систем, интеграции информационных систем, миграции программного замещения (импортозамещении), IT – обслуживании и сервисной поддержке организаций с филиальной структурой, комплексном обеспечении информационной безопасности.
        Работала с крупнейшими компаниями на российском рынке IT и телекоммуникационными компаниями, а также с государственными заказчиками.
        С мая 2017 года назначена на должность Финансового директора в ООО «РДЛ-Телеком».
        `,
          ["photos/sait-3.jpg"]
        ),
        new Card(
          "Вячеслав Климов",
          "photos/3.jpg",
          "Заместитель генерального директора",
          `Климов Вячеслав Алексеевич родился в 1981 году в Республике Кыргызстан.
          В 2004 году окончил Академию Противовоздушной обороны им. Г.К. Жукова в г. Тверь. По специальности Инженер Автоматизированных Систем Обработки Информации и Управления.
          Служил в 24 Центральном вычислительном центре.
          С 2006 по 2009 год работал на руководящих позициях в департаменте информационных технологий Ресторанного холдинга.
          С 2013 по 2016 год руководил проектами по поддержке и развитию Центра Обработки Данных АО «ФПК».
          С 2017 руководил проектом по внедрению Программно-аппаратного комплекса Информационная Магистраль на подвижном составе АО «ФПК».
          С марта 2018 года назначен на должность заместителя генерального директора ООО «РДЛ - Телеком».
          `,
          ["photos/sait-6.jpg"]
        ),
        new Card(
          "Юрий Лаврухин",
          "photos/4.jpg",
          "Директор по продажам",
          `Лаврухин Юрий Викторович – родился и вырос в г. Москва. 
        В 2000 году закончил Московский Технический Университет Связи и Информатики
        Факультет “Многоканальная электросвязь” по специальности “Многоканальные телекоммуникационные системы”. Инженер, Степень - Бакалавр.
        С 2006 по 2007 годы получил дополнительное образование по программе “Менеджмент” в ГОУ ДПО Межотраслевой институт повышения квалификации кадров по новым направлениям развития техники и технологии при МГТУ им. Баумана.
        После окончания института проходил службу в космических войсках ВС РФ в звании старшего лейтенанта. В лаборатории по защите и безопасности информации.
        С августа 2003 года по 2004 год работал в ОАО “Московская телекоммуникационная корпорация КОМКОР” в должности «Инженер».
        До марта 2008 года работал в ООО “Проектно-монтажная компания СЕТЬ”, сначала на должности ведущего инженера проектного отдела, а затем Главного инженера проекта. Ключевые заказчики компании “Комкор-ТВ” (Акадо-Телеком) и Строительная компания “Дон-строй”.
        В 2008 году перешёл на должность старшего менеджера отдела продаж в ЗАО “Компания ТрансТелеКом” (КТТК).
        В 2012 году стал Начальником отдела продаж, сфокусировав продажи телекоммуникационных услуг компании преимущественно в сегменте ОАО “РЖД”.
        С мая 2018 года назначен на должность Директора по продажам в ООО «РДЛ-Телеком».
        `,
          ["photos/sait-2.jpg"]
        ),
        new Card(
          "Вадим Степанов",
          "photos/5.jpg",
          "Директор проектов",
          `С мая 2018 года назначен на должность Директора по проектам в ООО «РДЛ-Телеком».
        `,
          ["photos/sait-11.jpg"]
        ),
        new Card(
          "Александр Шинов",
          "photos/6.jpg",
          "Директор по разработке программного обеспечения",
          `Шинов Александр Александрович родился в 1994 году в г. Долгопрудный Московской области.
          В 2017 году окончил с красным дипломом Московский Физико-Технический Институт, магистр по направлению «Системный анализ и управление».
          С 2013 по 2014 год работал в Ракетно-космической Корпорации «Энергия» в должности Программист.
          С 2014 по 2015 года был трудоустроен в ООО «Виртуальные Технологии» в должности Директора информационно-вычислительного центра.
          С 2016 года начал трудовую деятельность в ООО «РДЛ-Телеком» в должности Главного специалиста серверных решений. Далее в мае 2017 года перешёл на должность Руководителя отдела разработки программного обеспечения. А в июне 2018 года получил должность Директора по разработке программного обеспечения.
          `,
          ["photos/sait-15.jpg"]
        ),
        new Card(
          "Дмитрий Черкашин",
          "photos/7.jpg",
          "Заместитель директора по разработке программного обеспечения",
          `Черкашин Дмитрий Александрович родился 1990 года в г. Новосибирск.
          В 2012 году окончил «Сибирский государственный университет телекоммуникаций и информатики» с квалификацией Инженер, специализация «Многоканальные беспроводные телекоммуникационные системы». 
          С 2012 по декабрь 2013 года работал в ООО «Новотелеком» в должности «Инженер отдела мониторинга». 
          В конце 2013 года перешёл в ЗАО «Центр Финансовых Технологий» в отдел мониторинга работы ПО и сервисов на должность «Инженер».
          В начале 2016 года устроился в ООО «РДЛ-Телеком» на должность Инженера по прикладному сопровождению. С марта 2018 года был переведён на должность Главного специалиста отдела разработки программного обеспечения. А с января 2019 года назначен на должность Заместителя директора по разработке программного обеспечения.
          `,
          ["photos/sait-18.jpg"]
        ),
        new Card(
          "Андрей Гнатовский",
          "photos/8.jpg",
          "Начальник отдела эксплуатации",
          `Гнатовский Андрей Олегович - Родился в 1993г. в г. Кострома.
          В 2015 году окончил "Московский автомобильно-дорожный государственный технический университет (МАДИ)" по специальности "Автоматизация технологических процессов и производств", квалификация «Инженер специалист».
          На последнем курсе университета был принят в ООО «РДЛ-Телеком» на должность Инженера. 
          С июня 2016 года переведен на должность Руководителя отдела внедрения, а уже в июне 2017 года получил должность Начальника службы эксплуатации.
          `,
          ["photos/sait-8.jpg"]
        ),
        new Card(
          "Александр Сухоставский",
          "photos/9.jpg",
          "Руководитель службы технической поддержки",
          `Сухоставский Александр Борисович родился в 1959 г. в г. Поставы, Республики Беларусь.
          С 1976 по 1980 гг. обучался в «Балашовском ВВАУЛ им. Маршала Новикова».
          После окончания училища служил в ВС СССР и РФ и в 1996 году был уволен в запас в должности подполковника/ командира отряда Ан-12. 
          С сентября 1996 г. по 1998 г. работал в Ермолинском Лётно-Испытательном Подразделении в НПО «Вега - М» в должности Командира воздушного судна Ан-12, Пилот 1-го класса.
          С сентября 1998 г. по август 2000 г. работал в ОАО «Газпромавиа» в должности Заместителя руководителя Службы Авиационной Безопасности аэропорта.
          С августа 2000 по сентябрь 2017 года трудоустроен в ОАО «Вымпелком» Начальником отдела диспетчеризации в службе Мониторинга и Управления Технической дирекции Московского региона/
          До октября 2018 года работал в АО «Нокиа Солюшнз энд Нетворкс» в должности Начальника отдела диспетчеризации в службе Мониторинга и Управления Дирекции по эксплуатации Московского региона.
          В декабре 2018 года принят на должность Руководителя службы технической поддержки в ООО «РДЛ-Телеком».
          `,
          ["photos/sait-14.jpg"]
        )
      ]
    };
  },
  watch: {
    showPopup() {
      if (this.showPopup) {
        document.documentElement.style.overflow = "hidden";
      } else {
        document.documentElement.style.overflow = "auto";
      }
    }
  },
  components: { person }
};
</script>

<style lang="scss" scoped>
@import "../scss/style.scss";

.team {
  /*background-image: url("../assets/b.jpg");*/
  /*background-repeat: no-repeat;*/
  /*background-size: cover;*/
  background: $color_dark;
  padding: 2rem 0;
  font-size: 1.4rem;

  @media (min-width: $tablet-width) {
    font-size: 1.8rem;
  }

  &__gallery {
    padding: 0;
    margin: 3.5rem auto;
    display: grid;
    grid-gap: 1.5rem;
    grid-template-columns: repeat(2, 1fr);
    @media (min-width: $tablet-width) {
      padding: 0 2rem;
      grid-template-columns: repeat(5, 1fr);
    }
  }

  &__small-text {
    font-size: 1.4rem;
    text-shadow: 0.1rem 0.1rem 0.5rem black;
    line-height: 2rem;
  }

  &__photo {
    height: 100%;
    transform: translateX(0rem) scale(1.2);
    backface-visibility: hidden;
    transition: all 0.5s;
    background-position: top center;
  }

  &__caption {
    position: absolute;
    top: 50%;
    left: 50%;
    transform: translate(-50%, 20%);
    color: $color-white;
    text-transform: uppercase;
    font-size: 1.7rem;
    line-height: 2rem;
    text-align: center;
    opacity: 0;
    transition: all 0.5s;
    backface-visibility: hidden;
  }

  &__shape {
    max-width: 90%;
    position: relative;
    overflow: hidden;
    border-radius: 2rem;
    border: 0.2rem solid $color_orange;
    margin: 0 auto;

    @media (min-width: $tablet-width) {
    }

    @media (min-width: $desktop-width) {
    }

    &:hover .team__caption {
      opacity: 1;
      transform: translate(-50%, -50%);
    }

    &:hover .team__photo {
      transform: translateX(0rem) scale(1);
      filter: blur(3px) brightness(80%);
    }
  }
}
</style>

